# General configuration

In [2]:
# Libraries used
import sqlite3 
import os
import pandas as pd

In [3]:
# Paths 
wd = os.getcwd()
db = "adventureworks_sql_lite.sqlite" # same archive contained in the repository
db_path = os.path.join(wd, db)

In [4]:
# Function used to display the query made with sql on python with sqlite3

def mostrar_query (query, limite = 3, dataset = True):
    cursor.execute(query)
    columnas = [desc[0] for desc in cursor.description]
    filas = cursor.fetchmany(limite)
    try:
        if dataset:
            dataset_final = pd.DataFrame(filas, columns=columnas)
            return dataset_final
        else:
            return filas
    except Exception as e:
        print (f"No se puede mostrar la consulta, la palida es: {e}")

In [5]:
# Database conection with sqlite3

conn = sqlite3.connect(db_path)
cursor = conn.cursor()

# Exercises

##  Thematic Index by Conceptual Unit

### 1. Fundamentals of SQL Querying
*Using SELECT, WHERE, LIKE, logical operators, and NULL handling.*

In [6]:
# 1. Mostrar el contenido de la tabla Person, del esquema Person.

mostrar_query("""SELECT * 
              from 'Person.Person' p""")

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate
0,1,EM,0,,Ken,J,Sánchez,,0,,"<IndividualSurvey xmlns=""http://schemas.micros...",92C4279F-1207-48A3-8448-4636514EB7E2,2009-01-07 00:00:00
1,2,EM,0,,Terri,Lee,Duffy,,1,,"<IndividualSurvey xmlns=""http://schemas.micros...",D8763459-8AA8-47CC-AFF7-C9079AF79033,2008-01-24 00:00:00
2,3,EM,0,,Roberto,,Tamburello,,0,,"<IndividualSurvey xmlns=""http://schemas.micros...",E1A2555E-0828-434B-A33B-6F38136A37DE,2007-11-04 00:00:00

In [7]:
# 2. Mostrar los nombres y apelllido de cada persona que tenga como tratamiento “Ms.”

mostrar_query("""
SELECT p.FirstName, p.LastName
FROM 'Person.Person' p
WHERE p.Title LIKE 'Ms%'
""")

  FirstName  LastName
0      Gail  Erickson
1    Janice    Galvin
2      Jill  Williams

In [8]:
#3. Personas con “Mr.” y apellido “White”

mostrar_query("""
SELECT *
FROM 'Person.Person' p
WHERE p.Title LIKE 'Mr%' COLLATE NOCASE
  AND p.LastName LIKE '%White' COLLATE NOCASE
""")

Empty DataFrame
Columns: [BusinessEntityID, PersonType, NameStyle, Title, FirstName, MiddleName, LastName, Suffix, EmailPromotion, AdditionalContactInfo, Demographics, rowguid, ModifiedDate]
Index: []

In [9]:
# 5. Mostrar los datos de las personas que tengan asignado el tipo “SP” ó el tipo “VC”.

mostrar_query("""
SELECT * 
FROM 'Person.Person' p
WHERE p.PersonType LIKE 'EM' OR p.PersonType LIKE 'VC'
""")

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate
0,1,EM,0,,Ken,J,Sánchez,,0,,"<IndividualSurvey xmlns=""http://schemas.micros...",92C4279F-1207-48A3-8448-4636514EB7E2,2009-01-07 00:00:00
1,2,EM,0,,Terri,Lee,Duffy,,1,,"<IndividualSurvey xmlns=""http://schemas.micros...",D8763459-8AA8-47CC-AFF7-C9079AF79033,2008-01-24 00:00:00
2,3,EM,0,,Roberto,,Tamburello,,0,,"<IndividualSurvey xmlns=""http://schemas.micros...",E1A2555E-0828-434B-A33B-6F38136A37DE,2007-11-04 00:00:00

In [10]:
#6. Mostrar el contenido de la tabla Employee, del esquema HumanResources

mostrar_query("""
SELECT * 
FROM 'HumanResources.Employee' AS e
""")

,BusinessEntityID,NationalIDNumber,LoginID,OrganizationNode,OrganizationLevel,JobTitle,BirthDate,MaritalStatus,Gender,HireDate,SalariedFlag,VacationHours,SickLeaveHours,CurrentFlag,rowguid,ModifiedDate
0,1,295847284,adventure-works\ken0,,,Chief Executive Officer,1969-01-29,S,M,2009-01-14,1,99,69,1,F01251E5-96A3-448D-981E-0F99D789110D,2014-06-30 00:00:00
1,2,245797967,adventure-works\terri0,58,1,Vice President of Engineering,1971-08-01,S,F,2008-01-31,1,1,20,1,45E8F437-670D-4409-93CB-F9424A40D6EE,2014-06-30 00:00:00
2,3,509647174,adventure-works\roberto0,5AC0,2,Engineering Manager,1974-11-12,M,M,2007-11-11,1,2,21,1,9BBBFB2C-EFBB-4217-9AB7-F97689328841,2014-06-30 00:00:00

In [11]:
# 7. Hallar el Id y fecha de nacimiento de los empleados que tengan como función “Research and
# Development Manager” y que tengan menos de 10 “VacationHours”.


mostrar_query("""
SELECT e.BusinessEntityID AS id
FROM 'HumanResources.Employee' e
WHERE e.JobTitle = 'Research and Development Manager'
  AND e.VacationHours < 10
""")

Empty DataFrame
Columns: [id]
Index: []

In [12]:
# 8. ¿Cuáles son los tipos de “género” que figuran en la tabla de empleados?

mostrar_query("""
SELECT DISTINCT e.Gender 
FROM 'HumanResources.Employee' AS e
""")

  Gender
0      M
1      F

In [13]:
# 9. Mostrar el id, nombres, apellido de los empleados ordenados desde el de fecha de nacimiento
# más antigua.


mostrar_query("""
SELECT p.BusinessEntityID AS id, p.FirstName, p.LastName
FROM 'HumanResources.Employee' AS e
JOIN 'Person.Person' AS p ON e.BusinessEntityID = p.BusinessEntityID
ORDER BY e.BirthDate ASC
""")

   id FirstName  LastName
0  84     Frank  Martinez
1   5      Gail  Erickson
2  63    Maciej     Dusza

In [14]:
#10.Mostrar el contenido de la tabla Departments


mostrar_query("""
SELECT * 
FROM 'HumanResources.Department' AS d
""")

  DepartmentID         Name                 GroupName         ModifiedDate
0            1  Engineering  Research and Development  2008-04-30 00:00:00
1            2  Tool Design  Research and Development  2008-04-30 00:00:00
2            3        Sales       Sales and Marketing  2008-04-30 00:00:00

In [15]:
#11.¿Cuáles son los departamentos que están agrupados como “Manufacturing” ó como “Quality
#Assurance”?

mostrar_query("""
SELECT * 
FROM 'HumanResources.Department' AS d
WHERE d.GroupName = 'Manufacturing' OR d.GroupName = 'Quality Assurance'
""")

  DepartmentID                Name          GroupName         ModifiedDate
0            7          Production      Manufacturing  2008-04-30 00:00:00
1            8  Production Control      Manufacturing  2008-04-30 00:00:00
2           12    Document Control  Quality Assurance  2008-04-30 00:00:00

### 2. Joins and Table Relationships

In [16]:
# Ejercicio 12 - ¿Cuáles son los datos de los departamentos cuyo nombre esté relacionado con “Production”?
mostrar_query(""" 
SELECT * 
FROM 'HumanResources.Department' AS d
WHERE d.Name LIKE 'Production'
""")

  DepartmentID        Name      GroupName         ModifiedDate
0            7  Production  Manufacturing  2008-04-30 00:00:00

In [17]:
# Ejercicio 13 - Mostrar los datos de los departamentos que no estén agrupados como “Research and Develpment”
mostrar_query(""" 
SELECT * 
FROM 'HumanResources.Department' AS d
WHERE d.Name NOT LIKE 'Research and Develpment'
""")

  DepartmentID         Name                 GroupName         ModifiedDate
0            1  Engineering  Research and Development  2008-04-30 00:00:00
1            2  Tool Design  Research and Development  2008-04-30 00:00:00
2            3        Sales       Sales and Marketing  2008-04-30 00:00:00

In [18]:
# Ejercicio 14 - Mostrar los datos de la tabla Product del esquema Production
mostrar_query(""" 
SELECT * 
FROM 'Production.Product' AS p
""")

,ProductID,Name,ProductNumber,MakeFlag,FinishedGoodsFlag,Color,SafetyStockLevel,ReorderPoint,StandardCost,ListPrice,...,ProductLine,Class,Style,ProductSubcategoryID,ProductModelID,SellStartDate,SellEndDate,DiscontinuedDate,rowguid,ModifiedDate
0,1,Adjustable Race,AR-5381,0,0,,1000,750,0.0000,0.0000,...,,,,,,2008-04-30 00:00:00,,,694215B7-08F7-4C0D-ACB1-D734BA44C0C8,2014-02-08 10:01:36
1,2,Bearing Ball,BA-8327,0,0,,1000,750,0.0000,0.0000,...,,,,,,2008-04-30 00:00:00,,,58AE3C20-4F3A-4749-A7D4-D568806CC537,2014-02-08 10:01:36
2,3,BB Ball Bearing,BE-2349,1,0,,800,600,0.0000,0.0000,...,,,,,,2008-04-30 00:00:00,,,9C21AED2-5BFA-4F18-BCB8-F11638DC2E4E,2014-02-08 10:01:36

In [19]:
# Ejercicio 15 - Hallar los productos que no tengan asignado color.
mostrar_query(""" 
SELECT * 
FROM 'Production.Product' AS p
WHERE p.Color IS NULL
""")

Empty DataFrame
Columns: [ProductID, Name, ProductNumber, MakeFlag, FinishedGoodsFlag, Color, SafetyStockLevel, ReorderPoint, StandardCost, ListPrice, Size, SizeUnitMeasureCode, WeightUnitMeasureCode, Weight, DaysToManufacture, ProductLine, Class, Style, ProductSubcategoryID, ProductModelID, SellStartDate, SellEndDate, DiscontinuedDate, rowguid, ModifiedDate]
Index: []

[0 rows x 25 columns]

In [20]:
# Ejercicio 16 - Para todos los productos que tengan asignado algún color y que tengan un stock (SafetyStockLevel) mayor a 900, 
# mostrar su id, nombre y color. Ordenarlo por id descendente y por color ascendente.
mostrar_query(""" 
SELECT p.ProductID, p.Name, p.Color 
FROM 'Production.Product' AS p
WHERE p.Color IS NOT NULL AND p.SafetyStockLevel > 900
ORDER BY p.ProductID DESC, p.Color ASC
""")

  ProductID                    Name Color
0       421  Internal Lock Washer 2
1       420  Internal Lock Washer 8
2       419  Internal Lock Washer 1

In [21]:
# Ejercicio 32a - Verificar si existe una Foreign Key entre Employee y Person
mostrar_query("""
PRAGMA foreign_key_list('HumanResources.Employee')
""")

# Ejercicio 32b - Obtener el nombre, apellido, cargo y fecha de nacimiento de todos los empleados.
mostrar_query(""" 
SELECT e.BusinessEntityID, p.FirstName, p.LastName, e.JobTitle, e.BirthDate 
FROM 'HumanResources.Employee' AS e
LEFT JOIN 'Person.Person' AS p ON e.BusinessEntityID = p.BusinessEntityID
""")

# Ejercicio 32c - Obtener el nombre y apellido de los empleados que nacieron durante el año 1986 y su “género” es F.
mostrar_query(""" 
SELECT e.BusinessEntityID, p.FirstName, p.LastName, e.JobTitle, e.BirthDate 
FROM 'HumanResources.Employee' AS e
LEFT JOIN 'Person.Person' AS p ON e.BusinessEntityID = p.BusinessEntityID
WHERE strftime('%Y', e.BirthDate) = '1986' AND e.Gender = 'F'
""")

# Ejercicio 32d - Contar la cantidad de empleados cuyo nombre comience con la letra “J” y hayan nacido después del año 1977.
mostrar_query(""" 
SELECT COUNT(e.BusinessEntityID) 
FROM 'HumanResources.Employee' AS e
LEFT JOIN 'Person.Person' AS p ON e.BusinessEntityID = p.BusinessEntityID
WHERE strftime('%Y', e.BirthDate) > '1977' AND p.FirstName LIKE 'J%'
""")

# Ejercicio 32e - Para las mismas condiciones del punto anterior, ¿cuántos empleados están registrados según su género?
mostrar_query(""" 
SELECT e.Gender, COUNT(e.BusinessEntityID) 
FROM 'HumanResources.Employee' AS e
LEFT JOIN 'Person.Person' AS p ON e.BusinessEntityID = p.BusinessEntityID
WHERE strftime('%Y', e.BirthDate) > '1977' AND p.FirstName LIKE 'J%'
GROUP BY e.Gender
""")

  Gender  COUNT(e.BusinessEntityID)
0      F                          2
1      M                          5

In [22]:
# Ejercicio 33a - Obtener nombre, apellido y StoreID para aquellos clientes que estén en TerritoryID = 4 o que pertenezcan al tipo de persona 'SC'
mostrar_query(""" 
SELECT 
  p.FirstName, 
  p.LastName, 
  c.StoreID
FROM 'Sales.Customer' AS c
LEFT JOIN 'Person.Person' AS p 
  ON c.PersonID = p.BusinessEntityID
WHERE c.TerritoryID = 4 
   OR p.PersonType = 'SC'
""")

# Ejercicio 33b - Obtener nombre, apellido y número de orden (SalesOrderID) para los clientes que pertenezcan al tipo de persona 'SC'
mostrar_query(""" 
SELECT 
  p.FirstName, 
  p.LastName, 
  soh.SalesOrderID
FROM 'Sales.Customer' AS c
LEFT JOIN 'Person.Person' AS p 
  ON c.PersonID = p.BusinessEntityID
LEFT JOIN 'Sales.SalesOrderHeader' AS soh 
  ON c.CustomerID = soh.CustomerID
WHERE p.PersonType = 'SC'
""")

Empty DataFrame
Columns: [FirstName, LastName, SalesOrderID]
Index: []

In [23]:
# Ejercicio 34a - Descripción, tamaño y descripción de modelo de productos sin color y con SafetyStockLevel < 1000
mostrar_query(""" 
SELECT 
  pd.Description, 
  p.Size, 
  pm.CatalogDescription 
FROM 'Production.Product' AS p
LEFT JOIN 'Production.ProductModel' AS pm 
  ON p.ProductModelID = pm.ProductModelID 
LEFT JOIN 'Production.ProductModelProductDescriptionCulture' AS pmpdc 
  ON pm.ProductModelID = pmpdc.ProductModelID 
LEFT JOIN 'Production.ProductDescription' AS pd 
  ON pmpdc.ProductDescriptionID = pd.ProductDescriptionID
WHERE p.Color IS NULL AND p.SafetyStockLevel < 1000
""")



# Ejercicio 34b - Obtener ventas de junio y julio de 2011, incluyendo nombre, apellido del cliente, nro de venta, fecha, nombre y descripción del producto.
mostrar_query(""" 
SELECT 
  p.FirstName, 
  p.LastName, 
  soh.SalesOrderID, 
  soh.OrderDate, 
  pt.Name, 
  pd.Description
FROM 'Sales.SalesOrderHeader' AS soh
LEFT JOIN 'Sales.Customer' AS c 
  ON soh.CustomerID = c.CustomerID 
LEFT JOIN 'Person.Person' AS p 
  ON c.PersonID = p.BusinessEntityID
LEFT JOIN 'Sales.SalesOrderDetail' AS sod 
  ON soh.SalesOrderID = sod.SalesOrderID
LEFT JOIN 'Production.Product' AS pt 
  ON sod.ProductID = pt.ProductID
LEFT JOIN 'Production.ProductModelProductDescriptionCulture' AS pmpdc 
  ON pt.ProductModelID = pmpdc.ProductModelID AND pmpdc.CultureID = 'en'
LEFT JOIN 'Production.ProductDescription' AS pd 
  ON pmpdc.ProductDescriptionID = pd.ProductDescriptionID
WHERE strftime('%Y', soh.OrderDate) = '2011' 
  AND strftime('%m', soh.OrderDate) IN ('06', '07')
""")

  FirstName LastName SalesOrderID            OrderDate  Name Description
0      None     None        43702  2011-06-01 00:00:00  None        None
1      None     None        43703  2011-06-01 00:00:00  None        None
2      None     None        43704  2011-06-01 00:00:00  None        None

In [26]:
# Ejercicio 38  - Mostrar el ID de todos los vendedores y el ID de la venta (si existió), con revisión 9 en 2013.
mostrar_query(""" 
SELECT sp.BusinessEntityID, soh.SalesOrderID
FROM 'Sales.SalesPerson' AS sp  
LEFT JOIN 'Sales.SalesOrderHeader' AS soh 
    ON sp.BusinessEntityID = soh.SalesPersonID 
    AND soh.RevisionNumber = 9 
    AND strftime('%Y', soh.OrderDate) = '2013'
""")

  BusinessEntityID SalesOrderID
0              274         None
1              275         None
2              276         None

In [27]:
# Ejercicio 39 - Mostrar ID, nombre y apellido de los vendedores junto con el ID de venta (revisión 9, año 2013). Incluir vendedores sin ventas.
mostrar_query(""" 
SELECT sp.BusinessEntityID, p.FirstName, p.LastName, soh.SalesOrderID
FROM 'Sales.SalesPerson' AS sp  
LEFT JOIN 'Person.Person' AS p 
  ON sp.BusinessEntityID = p.BusinessEntityID 
LEFT JOIN 'Sales.SalesOrderHeader' AS soh 
  ON sp.BusinessEntityID = soh.SalesPersonID 
     AND soh.RevisionNumber = 9 
     AND strftime('%Y', soh.OrderDate) = '2013'
""")

  BusinessEntityID FirstName LastName SalesOrderID
0              274      None     None         None
1              275      None     None         None
2              276      None     None         None

### 3. Aggregation, Grouping, and Scalar Functions

In [28]:
# Ejercicio 17 - Hallar el Id y el nombre de los productos cuyo nombre comience con “Chain”
mostrar_query(""" 
SELECT p.ProductID, p.Name 
FROM 'Production.Product' AS p
WHERE p.Name LIKE 'Chain%'
""")

  ProductID             Name
0       320  Chainring Bolts
1       321    Chainring Nut
2       322        Chainring

In [29]:
# Ejercicio 18 - Hallar el Id y el nombre de los productos cuyo nombre contenga “helmet”
mostrar_query(""" 
SELECT p.ProductID, p.Name 
FROM 'Production.Product' AS p
WHERE p.Name LIKE '%helmet%'
""")

Empty DataFrame
Columns: [ProductID, Name]
Index: []

In [30]:
# Ejercicio 19 - Modificar la consulta anterior para que retorne aquellos productos cuyo nombre no contenga “helmet”
mostrar_query(""" 
SELECT p.ProductID, p.Name 
FROM 'Production.Product' AS p
WHERE p.Name NOT LIKE '%helmet%'
""")

  ProductID             Name
0         1  Adjustable Race
1         2     Bearing Ball
2         3  BB Ball Bearing

In [31]:
# Ejercicio 20 - Mostrar los datos principales de las personas (tabla Person) cuyo LastName termine con “es” y contenga en total 5 caracteres.
mostrar_query(""" 
SELECT * 
FROM 'Person.Person' AS p
WHERE p.LastName LIKE '___es'
""")

Empty DataFrame
Columns: [BusinessEntityID, PersonType, NameStyle, Title, FirstName, MiddleName, LastName, Suffix, EmailPromotion, AdditionalContactInfo, Demographics, rowguid, ModifiedDate]
Index: []

In [32]:
# Ejercicio 21 - Usando la tabla SpecialOffer del esquema Sales, mostrar la diferencia entre MinQty y MaxQty, con el id y descripción.
mostrar_query(""" 
SELECT so.SpecialOfferID, so.Description, so.MaxQty - so.MinQty AS DeltaQty
FROM 'Sales.SpecialOffer' AS so
""")

  SpecialOfferID               Description  DeltaQty
0              1               No Discount         0
1              2  Volume Discount 11 to 14         3
2              3  Volume Discount 15 to 24         9

In [33]:
# Ejercicio 23 - Para resolver el problema anterior, usar la función ISNULL para, cuando no tengan asignado valor, reemplazarlo en el cálculo por 0 (cero).
mostrar_query(""" 
SELECT 
  IFNULL(so.MaxQty, 0) - IFNULL(so.MinQty, 0) AS DeltaQty
FROM 'Sales.SpecialOffer' AS so
""")

   DeltaQty
0         0
1         3
2         9

In [34]:
# Ejercicio 24 - ¿Cuántos clientes están almacenados en la tabla Customers?
mostrar_query(""" 
SELECT COUNT(c.CustomerID) 
FROM 'Sales.Customer' AS c
""")

   COUNT(c.CustomerID)
0                  100

In [35]:
# Ejercicio 25 (primera parte) - ¿Cuál es la cantidad de clientes por tienda?
mostrar_query(""" 
SELECT c.StoreID, COUNT(c.CustomerID) AS CantidadClientes
FROM 'Sales.Customer' AS c
GROUP BY c.StoreID
""")

# Ejercicio 25 (segunda parte) - ¿Cuál es la cantidad de clientes por territorio?
mostrar_query(""" 
SELECT c.TerritoryID, COUNT(c.CustomerID) AS CantidadClientes
FROM 'Sales.Customer' AS c
GROUP BY c.TerritoryID
""")

# Ejercicio 25 (tercera parte) - ¿Cuáles son las tiendas (su Id) asociadas al territorio Id 4 que tienen menos de 2 clientes?
mostrar_query(""" 
SELECT c.StoreID 
FROM 'Sales.Customer' AS c
GROUP BY c.StoreID, c.TerritoryID
HAVING COUNT(c.CustomerID) < 2 AND c.TerritoryID = 4
""")

Empty DataFrame
Columns: [StoreID]
Index: []

In [36]:
# Ejercicio 26 - Para la tabla SalesOrderDetail del esquema Sales, calcular cuál es la cantidad total de items ordenados (OrderQty) para el producto con Id igual a 778.
mostrar_query(""" 
SELECT COUNT(sod.OrderQty)  
FROM 'Sales.SalesOrderDetail' AS sod 
WHERE sod.ProductID = 778
""")

   COUNT(sod.OrderQty)
0                    0

In [37]:
# Ejercicio 27a - ¿Cuál es el precio unitario más caro vendido?
mostrar_query(""" 
SELECT MAX(sod.UnitPrice)  
FROM 'Sales.SalesOrderDetail' AS sod
""")

# Ejercicio 27b - ¿Cuál es el número total de items ordenado para cada producto?
mostrar_query(""" 
SELECT sod.ProductID, COUNT(sod.OrderQty)  
FROM 'Sales.SalesOrderDetail' AS sod
GROUP BY sod.ProductID
""")

# Ejercicio 27c - ¿Cuál es la cantidad de líneas de cada orden?
mostrar_query(""" 
SELECT sod.SalesOrderID, COUNT(sod.ProductID)  
FROM 'Sales.SalesOrderDetail' AS sod
GROUP BY sod.SalesOrderID
""")

# Ejercicio 27d - ¿Cuál es la cantidad de líneas de cada orden, sólo para aquellas órdenes que tengan más de 3 líneas? Ordenar por id de orden descendente.
mostrar_query(""" 
SELECT sod.SalesOrderID, COUNT(sod.ProductID)  
FROM 'Sales.SalesOrderDetail' AS sod
GROUP BY sod.SalesOrderID
HAVING COUNT(sod.ProductID) > 3
ORDER BY sod.SalesOrderID DESC
""")

# Ejercicio 27e - ¿Cuál es el importe total (LineTotal) de cada orden, para aquellas que tengan menos de 3 líneas?
mostrar_query(""" 
SELECT sod.SalesOrderID, SUM(sod.LineTotal) AS lt 
FROM 'Sales.SalesOrderDetail' AS sod
GROUP BY sod.SalesOrderID 
HAVING COUNT(sod.SalesOrderID) < 3
""")

# Ejercicio 27f - ¿Cuál es la cantidad distinta de productos ordenados?
mostrar_query(""" 
SELECT COUNT(DISTINCT sod.SalesOrderID)  
FROM 'Sales.SalesOrderDetail' AS sod
""")

   COUNT(DISTINCT sod.SalesOrderID)
0                                10

In [38]:
# Ejercicio 28 - Usando la tabla SalesOrderHeader, ¿cuál es la cantidad de órdenes emitidas en cada año?
mostrar_query(""" 
SELECT strftime('%Y', soh.OrderDate) AS Anio, COUNT(soh.SalesOrderID) 
FROM 'Sales.SalesOrderHeader' AS soh
GROUP BY strftime('%Y', soh.OrderDate)
""")

   Anio  COUNT(soh.SalesOrderID)
0  2011                      100

In [39]:
# Ejercicio 29 - Usando la tabla SalesOrderHeader, ¿cuál es la cantidad de órdenes emitidas para cada cliente en cada año?
mostrar_query(""" 
SELECT soh.CustomerID, strftime('%Y', soh.OrderDate) AS Anio, COUNT(soh.SalesOrderID) 
FROM 'Sales.SalesOrderHeader' AS soh
GROUP BY soh.CustomerID, strftime('%Y', soh.OrderDate)
""")

  CustomerID  Anio  COUNT(soh.SalesOrderID)
0      11002  2011                        1
1      11003  2011                        1
2      11005  2011                        1

In [40]:
# Ejercicio 30 - Para los empleados, contar la cantidad de empleados solteros nacidos por año y por género, 
# para aquellos años donde hayan nacido más de 10 empleados.
mostrar_query(""" 
SELECT strftime('%Y', e.BirthDate) AS Anio, e.Gender, COUNT(e.LoginID) AS Cantidad 
FROM 'HumanResources.Employee' AS e
GROUP BY strftime('%Y', e.BirthDate), e.Gender
HAVING COUNT(e.LoginID) > 10
""")

Empty DataFrame
Columns: [Anio, Gender, Cantidad]
Index: []

In [41]:
# Ejercicio 31a - ¿Cuál es el promedio del precio de lista por color de producto?
mostrar_query(""" 
SELECT p.Color, AVG(p.ListPrice) AS PromedioPrecio 
FROM 'Production.Product' AS p 
GROUP BY p.Color
""")


# Ejercicio 31b - ¿Cuál es el promedio del precio de lista por color de producto para aquellos colores que tengan más de 15 productos?
mostrar_query(""" 
SELECT p.Color, AVG(p.ListPrice) AS PromedioPrecio 
FROM 'Production.Product' AS p 
GROUP BY p.Color 
HAVING COUNT(p.Color) > 15
""")

  Color  PromedioPrecio
0                   0.0

### 4. Logical Modeling and Cross-Analysis

In [42]:
# Ejercicio 40 - Mostrar todos los vendedores junto con los productos que han vendido (si los vendieron)
mostrar_query(""" 
SELECT 
  sp.BusinessEntityID, 
  p.ProductID
FROM 'Sales.SalesPerson' AS sp  
LEFT JOIN 'Sales.SalesOrderHeader' AS soh 
  ON sp.BusinessEntityID = soh.SalesPersonID 
LEFT JOIN 'Sales.SalesOrderDetail' AS sod 
  ON soh.SalesOrderID = sod.SalesOrderID 
LEFT JOIN 'Production.Product' AS p 
  ON sod.ProductID = p.ProductID
""")

  BusinessEntityID ProductID
0              274      None
1              275      None
2              275      None

In [43]:
# Ejercicio 41 - Mostrar todos los valores de BusinessEntityID de SalesPerson junto a cada ProductID de Product (producto cartesiano)
mostrar_query(""" 
SELECT 
  sp.BusinessEntityID, 
  p.ProductID
FROM 'Sales.SalesPerson' AS sp
CROSS JOIN 'Production.Product' AS p
""")

  BusinessEntityID ProductID
0              274         1
1              274         2
2              274         3

In [44]:
# Ejercicio 42 - Contar cuántas personas están registradas por tipo de contacto (ContactTypeID). Ordenar por cantidad descendente.
mostrar_query(""" 
SELECT 
  bec.ContactTypeID, 
  COUNT(p.BusinessEntityID) AS CantidadPersonas
FROM 'Person.Person' AS p
LEFT JOIN 'Person.BusinessEntityContact' AS bec 
  ON p.BusinessEntityID = bec.PersonID
GROUP BY bec.ContactTypeID
ORDER BY CantidadPersonas DESC
""")

  ContactTypeID  CantidadPersonas
0          None               100

In [46]:
# Ejercicio 44 - Calcular la suma de las cuotas de ventas históricas por persona y año. Mostrar el apellido.
mostrar_query(""" 
SELECT 
  strftime('%Y', spqh.QuotaDate) AS Anio, 
  spqh.BusinessEntityID, 
  p.LastName, 
  SUM(spqh.SalesQuota) AS TotalQuota
FROM 'Sales.SalesPersonQuotaHistory' AS spqh
JOIN 'Person.Person' AS p ON spqh.BusinessEntityID = p.BusinessEntityID
GROUP BY Anio, spqh.BusinessEntityID, p.LastName
""")

Empty DataFrame
Columns: [Anio, BusinessEntityID, LastName, TotalQuota]
Index: []

In [47]:
# Ejercicio 45 - Calcular el total vendido por territorio para aquellos con más de 100 ventas. Mostrar ID, nombre del territorio y suma de ventas.
mostrar_query(""" 
SELECT 
  soh.TerritoryID, 
  st.Name, 
  COUNT(soh.SalesOrderID) AS CantidadOrdenes, 
  SUM(sod.LineTotal) AS TotalVendido
FROM 'Sales.SalesOrderHeader' AS soh
JOIN 'Sales.SalesTerritory' AS st ON soh.TerritoryID = st.TerritoryID
JOIN 'Sales.SalesOrderDetail' AS sod ON soh.SalesOrderID = sod.SalesOrderID
GROUP BY soh.TerritoryID, st.Name 
HAVING COUNT(soh.SalesOrderID) >= 100
""")

Empty DataFrame
Columns: [TerritoryID, Name, CantidadOrdenes, TotalVendido]
Index: []

In [48]:
# Ejercicio 46 - Mostrar ID y nombre de provincias con más de 1000 domicilios registrados.
mostrar_query(""" 
SELECT 
  sp.StateProvinceID, 
  sp.Name, 
  COUNT(a.AddressID) AS CantidadDomicilios
FROM 'Person.StateProvince' AS sp
JOIN 'Person.Address' AS a ON sp.StateProvinceID = a.StateProvinceID
GROUP BY sp.StateProvinceID, sp.Name
HAVING COUNT(a.AddressID) > 1000
""")

Empty DataFrame
Columns: [StateProvinceID, Name, CantidadDomicilios]
Index: []

### 5. Subqueries and Common Table Expressions (CTEs)  
*Modular SQL logic with CTEs. Replacing correlated subqueries. Query chaining.*

In [50]:
# Ejercicio 48 (versión optimizada) - Calcular métricas por cliente una sola vez con CTE y luego unir con las órdenes
mostrar_query("""
WITH op1 (cus, c, a, min, max) AS (
  SELECT 
    CustomerID, 
    COUNT(*), 
    AVG(TotalDue), 
    MIN(TotalDue), 
    MAX(TotalDue)
  FROM 'Sales.SalesOrderHeader' AS soh
  GROUP BY soh.CustomerID
)
SELECT 
  soh.SalesOrderID, 
  op1.cus AS CustomerID,
  op1.c AS CountOfSales, 
  op1.a AS AvgSale,
  op1.min AS LowestSale, 
  op1.max AS HighestSale
FROM op1 
JOIN 'Sales.SalesOrderHeader' AS soh ON op1.cus = soh.CustomerID
""")

  SalesOrderID CustomerID  CountOfSales     AvgSale  LowestSale HighestSale
0        43659      29825             1  23153.2339  23153.2339  23153.2339
1        43660      29672             1   1457.3288   1457.3288   1457.3288
2        43661      29734             1  36865.8012  36865.8012  36865.8012

In [51]:
# Ejercicio 49 - Devolver una lista de los clientes con los productos solicitados en su pedido más reciente
mostrar_query(""" 
WITH fecha_ultima_compra AS (
  SELECT soh.CustomerID, soh.SalesOrderID, soh.OrderDate
  FROM 'Sales.SalesOrderHeader' AS soh
  WHERE soh.OrderDate = (
    SELECT MAX(soh2.OrderDate)
    FROM 'Sales.SalesOrderHeader' AS soh2
    WHERE soh2.CustomerID = soh.CustomerID
  )
)
SELECT 
  fuc.CustomerID, 
  p.Name AS NombreProducto
FROM fecha_ultima_compra AS fuc
LEFT JOIN 'Sales.SalesOrderDetail' AS sod ON sod.SalesOrderID = fuc.SalesOrderID
LEFT JOIN 'Production.Product' AS p ON sod.ProductID = p.ProductID
""")

  CustomerID NombreProducto
0      29825           None
1      29825           None
2      29825           None

In [52]:
# Ejercicio 50 - Mostrar el Rate del empleado y el promedio de Rate del departamento actual (usando CTE)
mostrar_query("""
WITH promedio_departamento AS (
  SELECT 
    edh2.DepartmentID, 
    AVG(eph2.Rate) AS avg_dep 
  FROM 'HumanResources.Employee' AS e2
  LEFT JOIN 'HumanResources.EmployeeDepartmentHistory' AS edh2 
    ON e2.BusinessEntityID = edh2.BusinessEntityID
  LEFT JOIN 'HumanResources.EmployeePayHistory' AS eph2 
    ON edh2.BusinessEntityID = eph2.BusinessEntityID
  WHERE edh2.EndDate IS NULL
  GROUP BY edh2.DepartmentID
)
SELECT 
  e.BusinessEntityID, 
  edh.DepartmentID, 
  eph.Rate, 
  pd.avg_dep 
FROM 'HumanResources.Employee' AS e
LEFT JOIN 'HumanResources.EmployeeDepartmentHistory' AS edh 
  ON e.BusinessEntityID = edh.BusinessEntityID AND edh.EndDate IS NULL
LEFT JOIN promedio_departamento AS pd 
  ON edh.DepartmentID = pd.DepartmentID
LEFT JOIN 'HumanResources.EmployeePayHistory' AS eph 
  ON edh.BusinessEntityID = eph.BusinessEntityID
""")

  BusinessEntityID DepartmentID  Rate avg_dep
0                1         None  None    None
1                2         None  None    None
2                3         None  None    None

### 6. Business-Oriented Query Applications  

*Customer behavior analysis, employee efficiency, detecting unsold or incomplete records.*

In [ ]:
# Ejercicio 36 - Mostrar la descripción de los productos y el ID de la orden de venta. Incluir productos que nunca se hayan vendido.
mostrar_query(""" 
SELECT pd.Description, sod.SalesOrderDetailID
FROM 'Production.Product' AS pt
LEFT JOIN 'Production.ProductModelProductDescriptionCulture' AS pmpdc 
  ON pt.ProductModelID = pmpdc.ProductModelID AND pmpdc.CultureID = 'en'
LEFT JOIN 'Production.ProductDescription' AS pd 
  ON pmpdc.ProductDescriptionID = pd.ProductDescriptionID
LEFT JOIN 'Sales.SalesOrderDetail' AS sod 
  ON pt.ProductID = sod.ProductID
""")

  Description SalesOrderDetailID
0        None               None
1        None               None
2        None               None

In [ ]:
# Ejercicio 37 - Mostrar la descripción de los productos que nunca hayan sido vendidos.
mostrar_query(""" 
SELECT DISTINCT pd.Description
FROM 'Production.Product' AS pt
LEFT JOIN 'Production.ProductModelProductDescriptionCulture' AS pmpdc 
  ON pt.ProductModelID = pmpdc.ProductModelID AND pmpdc.CultureID = 'en'
LEFT JOIN 'Production.ProductDescription' AS pd 
  ON pmpdc.ProductDescriptionID = pd.ProductDescriptionID
LEFT JOIN 'Sales.SalesOrderDetail' AS sod 
  ON pt.ProductID = sod.ProductID
WHERE sod.SalesOrderDetailID IS NULL AND pd.Description IS NOT NULL
""")

Empty DataFrame
Columns: [Description]
Index: []

In [ ]:
# Ejercicio 43 - Mostrar nombre y apellido de los empleados que viven en el estado de “Oregon”
mostrar_query(""" 
SELECT p.FirstName, p.LastName
FROM 'HumanResources.Employee' AS e
LEFT JOIN 'Person.Person' AS p ON p.BusinessEntityID = e.BusinessEntityID 
LEFT JOIN 'Person.BusinessEntityAddress' AS bea ON p.BusinessEntityID = bea.BusinessEntityID
LEFT JOIN 'Person.Address' AS a ON bea.AddressID = a.AddressID
LEFT JOIN 'Person.StateProvince' AS sp ON a.StateProvinceID = sp.StateProvinceID 
WHERE sp.Name = 'Oregon'
""")

Empty DataFrame
Columns: [FirstName, LastName]
Index: []

In [ ]:
# Ejercicio 47 - Usar CTE para calcular el máximo, mínimo y promedio de productos en locaciones (tabla ProductInventory)
mostrar_query(""" 
WITH productos (locacion, cantidad) AS (
  SELECT 
    LocationID, 
    SUM(pi2.Quantity) 
  FROM 'Production.ProductInventory' AS pi2
  LEFT JOIN 'Production.Product' AS p ON pi2.ProductID = p.ProductID
  GROUP BY LocationID
)
SELECT 
  AVG(cantidad) AS Promedio, 
  MIN(cantidad) AS Minimo, 
  MAX(cantidad) AS Maximo 
FROM productos
""")

      Promedio  Minimo  Maximo
0  6849.333333    2634   11332